# Найдите сумму цифр трехзначного числа.

a = input()
sum = (int(a[0]) + int(a[1]) + int(a[2]))
print(sum)